cfe llm/DataProcessors/AI_Клиент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>AI_Клиент</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cfe llm/InformationRegisters/AI_ЖурналЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_ЖурналЗапросов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусHTTP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходныеТокены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыходныеТокены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТулТокены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемныйПромт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Агенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДЗапроса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/InformationRegisters/AI_Диалоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_Диалоги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификатоБеседыСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AI_РольСообщения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторБеседы</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/Enums/AI_ТипAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_ТипAPI</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Responses</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ChatCompletions</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/Enums/AI_РольСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_РольСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>system</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>user</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>assistant</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>tool</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/Catalogs/AI_Агенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_Агенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СистемнаяИнструкция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Температура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксТокенов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляЛогики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НуженВебПоиск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкноКонтекстаВебПоиска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AI_РазмерКонтекстногоОкнаВебПоиска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзвлекатьОтветВСтруктуру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныйКонтекст</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контекст</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AI_ДополнительныйКонтекст</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>RAGКоллекции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коллекция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AI_RAGКоллекции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛимитФрагментовQdrant</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесКоллекции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинПорогСхожестиВектора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>RAGРазрешения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Разрешение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AI_RAGВидыРазрешений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>URLДляПоиска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>URL</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_Провайдеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_Провайдеры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>APIКлюч</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксКоличествоПотоков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПровайдерИсточникAPI</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитRPM</Name>
					<Comment>0 — без лимита. Максимум запросов в минуту к провайдеру.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитТокеновВСутки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АдресаСервисов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БазовыйURL</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.AI_ТипAPI</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_RAGКоллекции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_RAGКоллекции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.AI_RAG</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеКоллекции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКоллекции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоллекцияИнициализирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_Overlap</Name>
					<Comment>Еще не используется</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТипыДанныхКоллекции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеТипаСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/DataProcessors/AI_Клиент/Ext/ObjectModule.bsl
#Область ОписаниеПеременных

// Приватные переменные
Перем _СистемныйПромт;
Перем _Провайдер;
Перем _ПровайдерСтрокой;
Перем _ДанныеПровайдера;
Перем _Модель;
Перем _МодельСтрокой;
Перем _Температура;
Перем _APIКлюч;
Перем _БазовыйURL;
Перем _МаксТокенов;
Перем _ТипAPI;
Перем _ТекстовыйЗапрос;
Перем _FolderID; // Для YandexAI
Перем _РежимДиалога;
Перем _ГлубинаДиалога;
Перем _НуженВебПоиск;
Перем _ДополнительныйКонтекст;
Перем _ДанныеRAG;
Перем _РазмерОкнаКонтекстаВебПоиска;
Перем _URLАдреса;

// Ссылка на агента для логирования (может быть пустой при произвольных вызовах из Песочницы/ЧатПоДаннымБазы)
Перем _Агент;

// Уникальный идентификатор запроса — пишется в журнал, связывает лог с очередью AI_ОчередьЗапросов
Перем _ИДЗапроса;

// Для Responses API: хранит ID последнего ответа сервера для передачи как previous_response_id
// Это позволяет вести диалог без передачи истории сообщениями (нативный механизм Responses API)
Перем _ПредыдущийIDОтвета;

// Экспортные переменные
Перем Ответ Экспорт;
Перем ИзвлеченныйОтвет Экспорт;
Перем СоответствиеФайловИдентификаторам Экспорт;
Перем ИдентификаторДиалога Экспорт;
Перем ВходящиеТокены Экспорт;
Перем ВыходящиеТокены Экспорт;
Перем ТулТокены Экспорт;
Перем ОшибкаОбработки Экспорт;
Перем ИзвлекатьОтветВСтруктуру Экспорт;

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция Инициализировать(Знач Провайдер, Знач Модель, Знач ТипAPI, Знач РежимДиалога = Ложь, Знач ГлубинаДиалога = 0) Экспорт
	
	Ответ = Неопределено;
	СоответствиеФайловИдентификаторам = Новый Соответствие;
	ИзвлеченныйОтвет = Неопределено;
	ИдентификаторДиалога = Неопределено;
	ИзвлекатьОтветВСтруктуру = Ложь;
	ВходящиеТокены = 0;
	ВыходящиеТокены = 0;
	ТулТокены = 0;
	
	_СистемныйПромт = "";
	_Провайдер = Неопределено;
	_ПровайдерСтрокой = Неопределено;
	_Модель = Неопределено;
	_Температура = 0.9;
	_APIКлюч = Неопределено;
	_БазовыйURL = Неопределено;
	_МаксТокенов = 150000;
	_ТипAPI = Неопределено;
	_ТекстовыйЗапрос = "";
	_РежимДиалога = РежимДиалога;
	_ГлубинаДиалога = ГлубинаДиалога;
	_ДополнительныйКонтекст = Новый Массив;
	_ПредыдущийIDОтвета = "";
	_ДанныеRAG = Неопределено;
	_Агент = Справочники.AI_Агенты.ПустаяСсылка();
	_ИДЗапроса = Новый УникальныйИдентификатор;

	_Провайдер = Провайдер;
	_Модель = Модель;
	_ДанныеПровайдера = Справочники.AI_Провайдеры.ВсеДанныеПровайдера(_Провайдер);
	_ТипAPI = ТипAPI;
	_МодельСтрокой = Строка(Модель);
	
	// Финт ушами для поддержки произвольных провайдеров апи которых построен на базовых
	Если ЗначениеЗаполнено(_ДанныеПровайдера.ПровайдерИсточникAPI) Тогда
		_Провайдер = _ДанныеПровайдера.ПровайдерИсточникAPI;
	КонецЕсли;
	
	ИнициализироватьЗначенияСущностей();
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция ИнициализироватьСистемныйПромт(Знач Агент) Экспорт

	_Агент = Агент;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AI_Агенты.Ссылка КАК Ссылка,
		|	AI_Агенты.ПометкаУдаления КАК ПометкаУдаления,
		|	AI_Агенты.Наименование КАК Наименование,
		|	AI_Агенты.СистемнаяИнструкция КАК СистемнаяИнструкция,
		|	AI_Агенты.Температура КАК Температура,
		|	AI_Агенты.МаксТокенов КАК МаксТокенов,
		|	AI_Агенты.ИдентификаторДляЛогики КАК ИдентификаторДляЛогики,
		|	AI_Агенты.ОкноКонтекстаВебПоиска КАК ОкноКонтекстаВебПоиска,
		|	AI_Агенты.ИзвлекатьОтветВСтруктуру КАК ИзвлекатьОтветВСтруктуру,
		|	AI_Агенты.НуженВебПоиск КАК НуженВебПоиск
		|ИЗ
		|	Справочник.AI_Агенты КАК AI_Агенты
		|ГДЕ
		|	AI_Агенты.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	AI_ПромтыДополнительныйКонтекст.Контекст.ДанныеКонтекста КАК ДанныеКонтекста,
		|	AI_ПромтыДополнительныйКонтекст.Контекст.Наименование КАК Наименование,
		|	AI_ПромтыДополнительныйКонтекст.Контекст.ИдентификаторДляЛогики КАК ИдентификаторДляЛогики
		|ИЗ
		|	Справочник.AI_Агенты.ДополнительныйКонтекст КАК AI_ПромтыДополнительныйКонтекст
		|ГДЕ
		|	AI_ПромтыДополнительныйКонтекст.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	RAGКоллекции.ЛимитФрагментовQdrant КАК ЛимитФрагментовQdrant,
		|	RAGКоллекции.ВесКоллекции КАК ВесКоллекции,
		|	RAGКоллекции.МинПорогСхожестиВектора КАК МинПорогСхожестиВектора,
		|	AI_RAGКоллекции.Ссылка КАК Коллекция,
		|	AI_RAGКоллекции.Владелец КАК КомпонентRAG,
		|	AI_RAGКоллекции.Наименование КАК Наименование,
		|	AI_RAGКоллекции.КоллекцияИнициализирована КАК КоллекцияИнициализирована,
		|	AI_RAGКоллекции.ТипКоллекции КАК ТипКоллекции,
		|	AI_RAG.Наименование КАК КомпонентRAGНаименование,
		|	AI_RAG.Активен КАК КомпонентRAGАктивен,
		|	AI_RAG.EmbeddingURL КАК КомпонентRAGEmbeddingURL,
		|	AI_RAG.EmbeddingМодель КАК КомпонентRAGEmbeddingМодель,
		|	AI_RAG.EmbeddingРазмерность КАК КомпонентRAGEmbeddingРазмерность,
		|	AI_RAG.EmbeddingТаймаутСек КАК КомпонентRAGEmbeddingТаймаутСек,
		|	AI_RAG.QdrantURL КАК КомпонентRAGQdrantURL,
		|	AI_RAG.QdrantТаймаутСек КАК КомпонентRAGQdrantТаймаутСек,
		|	AI_RAG.EmbeddingAPIКлюч КАК КомпонентRAGEmbeddingAPIКлюч,
		|	AI_RAG.QdrantAPIКлюч КАК КомпонентRAGQdrantAPIКлюч
		|ИЗ
		|	Справочник.AI_Агенты.RAGКоллекции КАК RAGКоллекции
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AI_RAGКоллекции КАК AI_RAGКоллекции
		|		ПО RAGКоллекции.Коллекция = AI_RAGКоллекции.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AI_RAG КАК AI_RAG
		|		ПО (AI_RAGКоллекции.Владелец = AI_RAG.Ссылка)
		|ГДЕ
		|	RAGКоллекции.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	AI_RAGКоллекции.Владелец,
		|	AI_RAG.Наименование,
		|	AI_RAG.Активен,
		|	AI_RAG.EmbeddingURL,
		|	AI_RAG.EmbeddingМодель,
		|	AI_RAG.EmbeddingРазмерность,
		|	AI_RAG.EmbeddingТаймаутСек,
		|	AI_RAG.QdrantURL,
		|	AI_RAG.QdrantТаймаутСек,
		|	AI_RAG.EmbeddingAPIКлюч,
		|	AI_RAG.QdrantAPIКлюч,
		|	AI_RAGКоллекции.Ссылка,
		|	AI_RAGКоллекции.КоллекцияИнициализирована,
		|	AI_RAGКоллекции.Наименование,
		|	AI_RAGКоллекции.ТипКоллекции,
		|	RAGКоллекции.ЛимитФрагментовQdrant,
		|	RAGКоллекции.ВесКоллекции,
		|	RAGКоллекции.МинПорогСхожестиВектора
		|ИТОГИ ПО
		|	КомпонентRAG
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	AI_АгентыURLДляПоиска.URL КАК URL
		|ИЗ
		|	Справочник.AI_Агенты.URLДляПоиска КАК AI_АгентыURLДляПоиска";
	
	Запрос.УстановитьПараметр("Ссылка", Агент);
	РезультатПакет = Запрос.ВыполнитьПакет();
	
	ДанныеАгента = РезультатПакет[0].Выгрузить()[0];
	ДанныеДопКонтекстов = РезультатПакет[1].Выгрузить();
	ДанныеRAG = РезультатПакет[2];
	ОграниченияURL = РезультатПакет[3].Выгрузить().ВыгрузитьКолонку("URL");
	
	_СистемныйПромт = ДанныеАгента.СистемнаяИнструкция;
	_Температура = ДанныеАгента.Температура;
	_МаксТокенов = ДанныеАгента.МаксТокенов;
	_НуженВебПоиск = ДанныеАгента.НуженВебПоиск;
	_РазмерОкнаКонтекстаВебПоиска = нрег(ДанныеАгента.ОкноКонтекстаВебПоиска);
	_URLАдреса = ОграниченияURL;
	ИзвлекатьОтветВСтруктуру = ДанныеАгента.ИзвлекатьОтветВСтруктуру;
	
	
	// Дополнительный контекст
	_ДополнительныйКонтекст = Новый Массив;
	Для Каждого Контекст Из ДанныеДопКонтекстов Цикл
		_ДополнительныйКонтекст.Добавить(Контекст);
	КонецЦикла;
	
	// RAG данные
	МассивКомпонентRAG = Новый Массив;
	ДанныеRAGОбход = ДанныеRAG.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ДанныеRAGОбход.Следующий() Цикл
		
		Если НЕ ДанныеRAGОбход.КомпонентRAGАктивен Тогда
			ВызватьИсключение СтрШаблон("Компонент RAG [%1] не активен. Продолжение невозможно.", ДанныеRAGОбход.КомпонентRAGНаименование);
		КонецЕсли;
		
		СтруктураRAG = Новый Структура;
		СтруктураRAG.Вставить("КомпонентRAG", ДанныеRAGОбход.КомпонентRAG);
		СтруктураRAG.Вставить("Наименование", ДанныеRAGОбход.КомпонентRAGНаименование);
		СтруктураRAG.Вставить("Активен", ДанныеRAGОбход.КомпонентRAGАктивен);
		СтруктураRAG.Вставить("EmbeddingURL", ДанныеRAGОбход.КомпонентRAGEmbeddingURL);
		СтруктураRAG.Вставить("EmbeddingМодель", ДанныеRAGОбход.КомпонентRAGEmbeddingМодель);
		СтруктураRAG.Вставить("EmbeddingТаймаутСек", ДанныеRAGОбход.КомпонентRAGEmbeddingТаймаутСек);
		СтруктураRAG.Вставить("QdrantURL", ДанныеRAGОбход.КомпонентRAGQdrantURL);
		СтруктураRAG.Вставить("QdrantТаймаутСек", ДанныеRAGОбход.КомпонентRAGQdrantТаймаутСек);
		СтруктураRAG.Вставить("EmbeddingAPIКлюч", ДанныеRAGОбход.КомпонентRAGEmbeddingAPIКлюч);
		СтруктураRAG.Вставить("QdrantAPIКлюч", ДанныеRAGОбход.КомпонентRAGQdrantAPIКлюч);
		СтруктураRAG.Вставить("EmbeddingРазмерность", ДанныеRAGОбход.КомпонентRAGEmbeddingРазмерность);
		СтруктураRAG.Вставить("МассивКоллекций", Новый Массив);
		
		ВыборкаКоллекций = ДанныеRAGОбход.Выбрать();
		
		Пока ВыборкаКоллекций.Следующий() Цикл
			
			Если НЕ ВыборкаКоллекций.КоллекцияИнициализирована Тогда
				ВызватьИсключение СтрШаблон("Связка RAG [%1] и коллекции [%2] не инициализирована. Воспользуйтесь обработкой AI_RAG", ДанныеRAGОбход.КомпонентRAGНаименование, ВыборкаКоллекций.Наименование);
			КонецЕсли;
			
			СтруктураКоллекции = Новый Структура;
			СтруктураКоллекции.Вставить("ИмяКоллекции", ВыборкаКоллекций.Наименование);
			СтруктураКоллекции.Вставить("ТипКоллекции", ВыборкаКоллекций.ТипКоллекции);
			СтруктураКоллекции.Вставить("ЛимитФрагментовQdrant", ВыборкаКоллекций.ЛимитФрагментовQdrant);
			СтруктураКоллекции.Вставить("ВесКоллекции", ВыборкаКоллекций.ВесКоллекции);
			СтруктураКоллекции.Вставить("МинПорогСхожестиВектора", ВыборкаКоллекций.МинПорогСхожестиВектора);
			
			СтруктураRAG.МассивКоллекций.Добавить(СтруктураКоллекции);
		КонецЦикла;
		
		МассивКомпонентRAG.Добавить(СтруктураRAG);
	КонецЦикла;
	
	_ДанныеRAG = МассивКомпонентRAG;
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция ИнициализироватьСистемныйПромтПроизвольный(Знач Инструкция, Знач Температура, Знач МаксТокенов, Знач ДанныеВебПоиска=Неопределено, Знач ДанныеRAG=Неопределено, Знач ДопКонтекст=Неопределено, Знач Агент = Неопределено) Экспорт

	_СистемныйПромт = Инструкция;
	Если Агент <> Неопределено Тогда
		_Агент = Агент;
	КонецЕсли;
	_Температура = Температура;
	_МаксТокенов = МаксТокенов;
	
	Если Не ДанныеВебПоиска = Неопределено Тогда
		_НуженВебПоиск = ДанныеВебПоиска.ИспользоватьВебПоиск;
		_РазмерОкнаКонтекстаВебПоиска = нрег(ДанныеВебПоиска.РазмерОкнаКонтекстаВебПоиска);
		Если ДанныеВебПоиска.Свойство("URL") Тогда
			_URLАдреса = ДанныеВебПоиска.URL;
		Иначе
			_URLАдреса = Новый Массив;
		КонецЕсли;
	Иначе
		_НуженВебПоиск = Ложь;
		_РазмерОкнаКонтекстаВебПоиска = Неопределено;
		_URLАдреса = Новый Массив;
	КонецЕсли;
	
	_ДанныеRAG = ДанныеRAG;
	
	Если ЗначениеЗаполнено(ДопКонтекст) Тогда
		_ДополнительныйКонтекст = ДопКонтекст;
	КонецЕсли;
	
	Возврат ЭтотОбъект;
	
КонецФункции

// Спросить
// Отправляет текстовый запрос к модели.
// Для ChatCompletions: передаёт историю через массив сообщений.
// Для Responses API: использует нативный механизм previous_response_id для диалога.
// Для OllamaNative: использует нативный API Ollama.
Функция Спросить(Знач ТекстовыйЗапрос) Экспорт
	
	_ТекстовыйЗапрос = ТекстовыйЗапрос;
	ОшибкаОбработки = "";
	
	Если _ТипAPI = Перечисления.AI_ТипAPI.ChatCompletions Тогда
		СпроситьChatCompletions();
	ИначеЕсли _ТипAPI = Перечисления.AI_ТипAPI.Responses Тогда
		СпроситьResponses();
	ИначеЕсли _ТипAPI = Перечисления.AI_ТипAPI.OllamaNative Тогда
		ВызватьИсключение "OllamaNative не поддерживается в методе Спросить. Используйте прямой вызов OPI_Ollama.";
	Иначе
		ВызватьИсключение СтрШаблон("Тип API [%1] не поддерживается.", _ТипAPI);
	КонецЕсли;
	
	Возврат ЭтотОбъект;
	
КонецФункции

// СпроситьСКартинкой
// Загружает файл изображения через Files API нужного провайдера и запрашивает ответ.
// Yandex: добавляет заголовок x-project и использует OPI_YandexAI для загрузки файла.
// OpenAI / Responses: стандартная загрузка через OPI_OpenAI.
// После получения ответа файл удаляется.
Функция СпроситьСКартинкой(Знач ТекстовыйЗапрос, Знач ИмяФайла, Знач ДвоичныеДанные, Знач Назначение = "user_data") Экспорт
	
	// Поддерживаемый тип картинок
	СоставИмениФайла	= СтрРазделить(ИмяФайла, ".", Ложь);
	РасширениеФайла		= СоставИмениФайла[СоставИмениФайла.ВГраница()];
	ПоддерживаемыеТипы	= "png,jpeg,jpg,webp";

	СписокПоддерживаемыхФорматов = СтрРазделить(ПоддерживаемыеТипы, ",", Ложь);
	Если СписокПоддерживаемыхФорматов.Найти(РасширениеФайла) = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Неподдерживаемый тип файла. Поддерживаемые типы: %1", ПоддерживаемыеТипы);
	КонецЕсли;
	// Конец проверки типа картинки
	
	_ТекстовыйЗапрос = ТекстовыйЗапрос;
	ОшибкаОбработки = "";
	
	ДополнительныеЗаголовки = Новый Соответствие;
	Если _Провайдер = Справочники.AI_Провайдеры.Yandex Тогда
		ДополнительныеЗаголовки.Вставить("OpenAI-Project", _FolderID);
	Иначе
		ДополнительныеЗаголовки.Вставить("x-project", _FolderID);
	КонецЕсли;
	
	Сообщения = Новый Массив;
	Если ЗначениеЗаполнено(_СистемныйПромт) Тогда
		Сообщения.Добавить(OPI_OpenAI.ПолучитьСообщениеСистемы(_СистемныйПромт));
	КонецЕсли;
	
	Если _Провайдер = Справочники.AI_Провайдеры.Yandex Тогда
		
		ДанныеФайла = Base64Строка(ДвоичныеДанные);//ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные);
		ДанныеФайла = СтрЗаменить(ДанныеФайла, Символы.ВК, "");
		ДанныеФайла = СтрЗаменить(ДанныеФайла, Символы.ПС, "");
		ДанныеФайла = СтрЗаменить(ДанныеФайла, " ", "");
		
		СтрокаДляПередачи = СтрШаблон("data:image/%1;base64,%2", РасширениеФайла, ДанныеФайла);
		
		СообщениеКартинки = AI_YandexAI.ПолучитьСтруктуруСообщенияКартинкиBase64("user", СтрокаДляПередачи, _ТекстовыйЗапрос);
		Сообщения.Добавить(СообщениеКартинки);
		
	Иначе
	
		Ответ = OPI_OpenAI.ЗагрузитьФайл(_БазовыйURL, _APIКлюч, ИмяФайла, ДвоичныеДанные, Назначение, ДополнительныеЗаголовки);
		
		ИдентификаторФайла = Ответ["id"];
		Если Не ЗначениеЗаполнено(ИдентификаторФайла) Тогда
			// Попытка с заглавной буквы (ряд провайдеров возвращают "ID")
			ИдентификаторФайла = Ответ["ID"];
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ИдентификаторФайла) Тогда
			ПреобразоватьОтветВСтроку();
			ОшибкаОбработки = "Не удалось получить ID загруженного файла. Ответ сервера: " + Ответ;
			Возврат ЭтотОбъект;
		КонецЕсли;
		
		СоответствиеФайловИдентификаторам.Вставить(ИмяФайла, ИдентификаторФайла);
		
		// Структура сообщения с картинкой одинакова для Yandex и OpenAI (оба используют file_id)
		Сообщение = OPI_OpenAI.ПолучитьСтруктуруСообщенияКартинки("user", ИдентификаторФайла, _ТекстовыйЗапрос);
		
	КонецЕсли;
	
	ДополнительныеПараметры = ИнициализироватьДополнительныеПараметрыИНавыки();
	
	// Для Yandex Responses при работе с файлами тоже используем Responses-эндпоинт
	Если _ТипAPI = Перечисления.AI_ТипAPI.Responses Тогда
		Ответ = OPI_OpenAI.ПолучитьОтветResponses(_БазовыйURL, _APIКлюч, _МодельСтрокой, Сообщения, ДополнительныеПараметры, ДополнительныеЗаголовки);
		Попытка
			ИзвлечьОтветResponses();
			ЛогироватьЗапрос();
		Исключение
			ОшибкаОбработки = ОписаниеОшибки();
		КонецПопытки;
	Иначе
		ВызватьИсключение "Метод работы с файлами доступен только для Responses API.";
	КонецЕсли;
	
	// Удаляем файл после использования
	Попытка
		OPI_OpenAI.УдалитьФайл(_БазовыйURL, _APIКлюч, ИдентификаторФайла);
	Исключение
		// Не критично — игнорируем ошибку удаления
	КонецПопытки;
	
	Попытка
		// Responses API: usage.input_tokens / output_tokens
		ВходящиеТокены = Ответ["usage"]["input_tokens"];
		ВыходящиеТокены = Ответ["usage"]["output_tokens"];
		ТулТокены = Ответ["usage"]["input_tokens_details"]["tool_tokens"]
	Исключение
	КонецПопытки;
	
	ЛогироватьЗапрос();
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция ПреобразоватьОтветВСтроку() Экспорт
	
	ПроверкаЗаполненияОтвета();
	Ответ = OPI_Инструменты.JSONСтрокой(Ответ);
	
КонецФункции

Функция ПреобразоватьОтветВСтруктуру() Экспорт
	
	ПроверкаЗаполненияОтвета();
	Ответ = OPI_Инструменты.JsonВСтруктуру(Ответ, Ложь);
	
КонецФункции

Функция ПреобразоватьОтветВСоответствие() Экспорт
	
	ПроверкаЗаполненияОтвета();
	Ответ = OPI_Инструменты.JsonВСтруктуру(Ответ, Истина);
	
КонецФункции

Функция ИзвлечьОтвет(ВСтруктуру = Ложь) Экспорт
	
	// Для Responses API — отдельный метод извлечения
	Если _ТипAPI = Перечисления.AI_ТипAPI.Responses Тогда
		ИзвлечьОтветResponses(ВСтруктуру);
		Возврат ИзвлеченныйОтвет;
	КонецЕсли;
	
	// ChatCompletions: choices[0].message.content
	ПреобразоватьОтветВСоответствие();
	
	ИзвлеченныйОтвет = Ответ["choices"][0]["message"]["content"];
	
	Если Лев(ИзвлеченныйОтвет, 3) = "```" Тогда
		ИзвлеченныйОтвет = Сред(ИзвлеченныйОтвет, 4, СтрДлина(ИзвлеченныйОтвет) - 4 - 3);
	КонецЕсли;
	
	Если ВСтруктуру Тогда
		ИзвлеченныйОтвет = OPI_Инструменты.JsonВСтруктуру(ИзвлеченныйОтвет, Ложь);
	КонецЕсли;
	
	Возврат ИзвлеченныйОтвет;
	
КонецФункции

// СброситьДиалогResponses
// Сбрасывает цепочку диалога для Responses API (обнуляет previous_response_id).
// Вызывать при необходимости начать новый диалог без создания нового экземпляра клиента.
Функция СброситьДиалогResponses() Экспорт
	_ПредыдущийIDОтвета = "";
	ИдентификаторДиалога = Неопределено;
	Возврат ЭтотОбъект;
КонецФункции

// УстановитьПредыдущийIDОтвета
// Восстанавливает ID предыдущего ответа для продолжения диалога в Responses API.
//
// Необходим потому, что объект AI_Клиент создаётся заново при каждом
// серверном вызове формы — _ПредыдущийIDОтвета теряется.
// Форма сохраняет этот ID в реквизите ИдентификаторДиалогаResponseApi
// и передаёт его через этот метод перед вызовом Спросить().
//
// Параметры:
//  ID - Строка - значение поля "id" из предыдущего ответа Responses API
//
// Возвращаемое значение:
//  ОбработкаОбъект.AI_Клиент - этот же объект
Функция УстановитьПредыдущийIDОтвета(Знач ID) Экспорт
	_ПредыдущийIDОтвета = ID;
	// Синхронизируем ИдентификаторДиалога — он виден снаружи и проверяется формой
	ИдентификаторДиалога = ID;
	Возврат ЭтотОбъект;
КонецФункции

// Подменяет автогенерируемый ИДЗапроса на внешний — нужно для связи лога
// с записью AI_ОчередьЗапросов.УникальныйИдентификатор.
Процедура УстановитьИДЗапроса(Знач ИД) Экспорт
	_ИДЗапроса = ИД;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициализироватьЗначенияСущностей()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ * Из Справочник.AI_Модели КАК AI_Модели ГДЕ AI_Модели.Ссылка = &Модель";
	
	Запрос.УстановитьПараметр("Модель", _Модель);
	
	ДанныеМодели = Запрос.Выполнить().Выгрузить()[0];
	_FolderID = ДанныеМодели.FolderID;
	
	Если Не _ДанныеПровайдера.Активен Тогда
		ВызватьИсключение СтрШаблон("Провайдер [%1] не активен. Работа завершена.", _Провайдер);
	КонецЕсли;
	
	Если Не Справочники.AI_Провайдеры.ТипПоддерживается(_ДанныеПровайдера, _ТипAPI) Тогда
		ВызватьИсключение СтрШаблон("Провайдер [%1]. Тип API [%2] не поддерживается. Работа завершена.", _Провайдер, _ТипAPI);
	КонецЕсли;
	
	_APIКлюч = _ДанныеПровайдера.APIКлюч;
	_БазовыйURL = _ДанныеПровайдера.АдресаСервисов[_ТипAPI];
	
КонецФункции

Процедура ПроверкаЗаполненияОтвета()
	
	Если Ответ = Неопределено Тогда
		ВызватьИсключение "Преобразование ответа невозможно. Ответ не инициализирован.";
	КонецЕсли;
	
КонецПроцедуры

Процедура ЛогироватьЗапрос()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ Константы.AI_ЛогироватьЗапросы.Получить() = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ = Неопределено Тогда
		ВызватьИсключение "Ответ не инициализирован. Последовательность вызовов нарушена. Продолжение не возможно";
	КонецЕсли;
	
	ОтветСервиса = OPI_Инструменты.JSONСтрокой(Ответ);
	
	РегистрыСведений.AI_ЖурналЗапросов.ЛогироватьЗапрос(
		_Агент, _ИДЗапроса,
		_Провайдер, _Модель, _СистемныйПромт, _ТекстовыйЗапрос,
		ОтветСервиса, ВходящиеТокены, ВыходящиеТокены, ТулТокены);
	
КонецПроцедуры

Процедура ПолучитьИдентификаторДиалога()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не _РежимДиалога Тогда
		Возврат;
	КонецЕсли;
	ИдентификаторДиалога = РегистрыСведений.AI_Диалоги.НачатьДиалог();
КонецПроцедуры

Процедура ЗаписатьСобытиеДиалога(Роль, Сообщение)
	
	Если Не _РежимДиалога Тогда
		Возврат;
	КонецЕсли;
	// Для Responses API диалог ведётся через previous_response_id — запись в AI_Диалоги не нужна
	Если _ТипAPI = Перечисления.AI_ТипAPI.Responses Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегистрыСведений.AI_Диалоги.ЗаписьСобытия(ИдентификаторДиалога, Роль, Сообщение);
КонецПроцедуры

Функция ПолучитьСобытияДиалога()
	УстановитьПривилегированныйРежим(Истина);
	Возврат РегистрыСведений.AI_Диалоги.ПолучитьСообщенияДиалога(ИдентификаторДиалога, _ГлубинаДиалога);
КонецФункции

Процедура ОбогатитьСообщенияИсторией(ПерваяИтерация, Сообщения)
	
	Если ПерваяИтерация Или Не _РежимДиалога Тогда
		Возврат;
	КонецЕсли;
	
	СообщенияИстории = ПолучитьСобытияДиалога();
	
	Для Каждого СообщениеИстории Из СообщенияИстории Цикл
		ДляДобавления = OPI_OpenAI.ПолучитьСтруктуруСообщения(
			СообщениеИстории.Роль,
			СообщениеИстории.Сообщение);
		Сообщения.Добавить(ДляДобавления);
	КонецЦикла;
	
КонецПроцедуры

Функция ИнициализироватьДополнительныеПараметрыИНавыки()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("temperature", _Температура);
	
	Если _ТипAPI = Перечисления.AI_ТипAPI.Responses Тогда
		ДополнительныеПараметры.Вставить("max_output_tokens", _МаксТокенов);
	Иначе
		ДополнительныеПараметры.Вставить("max_tokens", _МаксТокенов);
	КонецЕсли;
	
	Если _НуженВебПоиск И НЕ _ТипAPI = Перечисления.AI_ТипAPI.Responses Тогда
		ВызватьИсключение "Функция веб поиска работает только с Responses типом API";
	КонецЕсли;
	
	Если _НуженВебПоиск Тогда
		
		Если НЕ ДополнительныеПараметры.Свойство("tools") Тогда
			ДополнительныеПараметры.Вставить("tools", Новый Массив);
		КонецЕсли;
		
		СтруктураФункции = Новый Структура;
		СтруктураФункции.Вставить("type", "web_search");
		
		Если _Провайдер = Справочники.AI_Провайдеры.Yandex Тогда
			СтруктураФункции.Вставить("search_context_size", ?(ЗначениеЗаполнено(_РазмерОкнаКонтекстаВебПоиска), _РазмерОкнаКонтекстаВебПоиска, "medium"));
			// Принудительно устанавливаем необходимость поиска для Yandex провайдера
			ДополнительныеПараметры.Вставить("tool_choice", "required");
		Иначе
			// Что то для остальных
		КонецЕсли;
		
		Если ЗначениеЗаполнено(_URLАдреса) Тогда
			СтруктураФункции.Вставить("filters", Новый Структура("allowed_domains", Новый Массив));
			
			Для Каждого Адрес Из _URLАдреса Цикл
				СтруктураФункции.filters.allowed_domains.Добавить(Адрес);
			КонецЦикла;
		КонецЕсли;
		
		ДополнительныеПараметры.tools.Добавить(СтруктураФункции);
		
	КонецЕсли;
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

Функция ИнициализироватьМассивСообщений()
	
	СообщениеСистемы = OPI_OpenAI.ПолучитьСообщениеСистемы(_СистемныйПромт);
	СообщениеПользователя = OPI_OpenAI.ПолучитьСообщениеПользователя(_ТекстовыйЗапрос);
	
	ПерваяИтерация = Ложь;
	Если _РежимДиалога И Не ЗначениеЗаполнено(ИдентификаторДиалога) Тогда
		ПолучитьИдентификаторДиалога();
		ЗаписатьСобытиеДиалога(СообщениеСистемы.role, СообщениеСистемы.content);
		ПерваяИтерация = Истина;
	КонецЕсли;
	
	Сообщения = Новый Массив;
	Сообщения.Добавить(СообщениеСистемы);
	Сообщения.Добавить(СообщениеПользователя);
	
	ОбогатитьСообщенияИсторией(ПерваяИтерация, Сообщения);
	ОбогатитьСообщенияДополнительнымКонтекстом(Сообщения);
	
	Возврат Сообщения;
	
КонецФункции

Процедура ОбогатитьСообщенияДополнительнымКонтекстом(Сообщения)
	
	Для Каждого Контекст Из _ДополнительныйКонтекст Цикл
		ТекстСообщения = СтрШаблон("--%1--%2%3--end_context--",
			"context:" + Контекст.Наименование + " \\ " + Контекст.ИдентификаторДляЛогики,
			Символы.ПС,
			Контекст.ДанныеКонтекста);
		СтруктураСообщения = OPI_OpenAI.ПолучитьСтруктуруСообщения("user", ТекстСообщения);
		Сообщения.Добавить(СтруктураСообщения);
	КонецЦикла;
	
КонецПроцедуры

// ОбработатьВекторныйЗапрос
// Для каждого компонента RAG из _ДанныеRAG:
//   1. Получает embedding запроса через AI_RAG.ПолучитьВектор
//   2. Ищет похожие фрагменты в каждой коллекции через AI_RAG.ПоискПохожихВQdrant
//   3. Взвешивает результаты по ВесКоллекции
//   4. Возвращает массив фрагментов, отсортированных по score убыванию
//
// Возвращаемое значение:
//   Массив Из Структура — { score, text, header, subheader, nav_ref, chunk_num, chunks_total, entity_type }
//   Пустой массив если RAG не настроен или не нашёл ничего выше порога.
Функция ОбработатьВекторныйЗапрос()
	
	ВсеФрагменты = Новый Массив;
	
	Если _ДанныеRAG = Неопределено Или _ДанныеRAG.Количество() = 0 Тогда
		Возврат ВсеФрагменты;
	КонецЕсли;
	
	Для Каждого КомпонентRAG Из _ДанныеRAG Цикл
		
		Если Не КомпонентRAG.Активен Тогда
			Продолжить;
		КонецЕсли;
		
		// Получаем вектор запроса — один раз на компонент (один embedding-сервис)
		Попытка
			ВекторЗапроса = AI_RAG.ПолучитьВектор(КомпонентRAG, _ТекстовыйЗапрос);
		Исключение
			
			ТекстОшибки = СтрШаблон("Ошибка получения вектора [%1]: %2", КомпонентRAG.Наименование, ОписаниеОшибки());
			
			ЗаписьЖурналаРегистрации(
				"AI_Клиент.RAG",
				УровеньЖурналаРегистрации.Ошибка,
				,
				,
				ТекстОшибки);
				
			ВызватьИсключение ТекстОшибки;
				
		КонецПопытки;
		
		// Поиск по каждой коллекции компонента
		Для Каждого Коллекция Из КомпонентRAG.МассивКоллекций Цикл
			
			Попытка
				ФильтрПоАгенту = AI_RAG.ПостроитьФильтрПоАгенту(_Агент);
				РезультатыПоиска = AI_RAG.ПоискПохожихВQdrant(
					КомпонентRAG,
					Коллекция.ИмяКоллекции,
					ВекторЗапроса,
					Коллекция.ЛимитФрагментовQdrant,
					Коллекция.МинПорогСхожестиВектора,
					ФильтрПоАгенту);
			Исключение
					
				ТекстОшибки = СтрШаблон("Ошибка поиска в коллекции [%1]: %2", Коллекция.ИмяКоллекции, ОписаниеОшибки());
					
				ЗаписьЖурналаРегистрации(
					"AI_Клиент.RAG",
					УровеньЖурналаРегистрации.Ошибка,
					,
					,
					ТекстОшибки);
					
				ВызватьИсключение ТекстОшибки;
					
			КонецПопытки;
			
			// Применяем вес коллекции к score каждого фрагмента и нормализуем payload
			Для Каждого Точка Из РезультатыПоиска Цикл
				
				Payload = Точка["payload"];
				Если Не ЗначениеЗаполнено(Payload) Тогда
					Продолжить;
				КонецЕсли;
				
				Фрагмент = Новый Структура;
				Фрагмент.Вставить("score",        Точка["score"] * Коллекция.ВесКоллекции);
				Фрагмент.Вставить("text",         ?(Payload.Свойство("text"),         Payload["text"],         ""));
				Фрагмент.Вставить("header",       ?(Payload.Свойство("header"),       Payload["header"],       ""));
				Фрагмент.Вставить("subheader",    ?(Payload.Свойство("subheader"),    Payload["subheader"],    ""));
				Фрагмент.Вставить("nav_ref",      ?(Payload.Свойство("nav_ref"),      Payload["nav_ref"],      ""));
				Фрагмент.Вставить("entity_type",  ?(Payload.Свойство("entity_type"),  Payload["entity_type"],  ""));
				Фрагмент.Вставить("chunk_num",    ?(Payload.Свойство("chunk_num"),    Payload["chunk_num"],    0));
				Фрагмент.Вставить("chunks_total", ?(Payload.Свойство("chunks_total"), Payload["chunks_total"], 1));
				
				ВсеФрагменты.Добавить(Фрагмент);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Сортировка по score убыванию (пузырьком — массивы обычно небольшие)
	Если ВсеФрагменты.Количество() > 1 Тогда
		ВсеФрагменты = СортироватьФрагментыПоScore(ВсеФрагменты);
	КонецЕсли;
	
	Возврат ВсеФрагменты;
	
КонецФункции

// ОтсортироватьФрагментыПоScore
// Сортировка пузырьком — массивы фрагментов обычно небольшие (< 50 элементов).
Функция ОтсортироватьФрагментыПоScore(МассивФрагментов)

	Н = МассивФрагментов.ВГраница();

	Пока Н > 0 Цикл
		Для Индекс = 0 По Н - 1 Цикл
			Если МассивФрагментов[Индекс]["score"] < МассивФрагментов[Индекс + 1]["score"] Тогда
				Временный              = МассивФрагментов[Индекс];
				МассивФрагментов[Индекс]    = МассивФрагментов[Индекс + 1];
				МассивФрагментов[Индекс + 1] = Временный;
			КонецЕсли;
		КонецЦикла;
		Н = Н - 1;
	КонецЦикла;

	Возврат МассивФрагментов;

КонецФункции

// ОбогатитьСообщенияRAG
// Формирует одно системное сообщение из найденных фрагментов и добавляет
// его в массив сообщений перед запросом пользователя.
//
// Формат блока для LLM:
//   --RAG_CONTEXT--
//   ### Контрагент: ООО Ромашка (чанк 1/1)
//   Наименование: ООО Ромашка
//   ИНН: 7700000001
//   ...
//   --END_RAG_CONTEXT--
//
// Параметры:
//   Сообщения        - Массив - массив сообщений для LLM (изменяется)
//   МассивФрагментов - Массив - результат ОбработатьВекторныйЗапрос()
Процедура ОбогатитьСообщенияRAG(Сообщения, МассивФрагментов)

	Если Не ЗначениеЗаполнено(МассивФрагментов) Или МассивФрагментов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ЧастиТекста = Новый Массив;
	ЧастиТекста.Добавить("--RAG_CONTEXT--");

	Для Каждого Фрагмент Из МассивФрагментов Цикл

		// Заголовок блока — собираем из header / subheader / чанк-инфо
		Заголовок = Фрагмент["header"];
		Если ЗначениеЗаполнено(Фрагмент["subheader"]) Тогда
			Заголовок = Заголовок + " / " + Фрагмент["subheader"];
		КонецЕсли;

		ВсегоЧанков = Фрагмент["chunks_total"];
		Если ВсегоЧанков > 1 Тогда
			Заголовок = СтрШаблон("%1 (чанк %2/%3)",
				Заголовок, Фрагмент["chunk_num"], ВсегоЧанков);
		КонецЕсли;

		ЧастиТекста.Добавить("### " + Заголовок);
		ЧастиТекста.Добавить(Фрагмент["text"]);

		// Навигационная ссылка — полезна если LLM должен ссылаться на источник
		Если ЗначениеЗаполнено(Фрагмент["nav_ref"]) Тогда
			ЧастиТекста.Добавить("[источник: " + Фрагмент["nav_ref"] + "]");
		КонецЕсли;

		ЧастиТекста.Добавить(""); // пустая строка-разделитель между фрагментами

	КонецЦикла;

	ЧастиТекста.Добавить("--END_RAG_CONTEXT--");

	ТекстRAG = СтрСоединить(ЧастиТекста, Символы.ПС);

	// Вставляем как сообщение от пользователя перед фактическим запросом —
	// это стандартная техника RAG для ChatCompletions API.
	// Позиция: после системного промта (индекс 0), перед запросом пользователя.
	СообщениеRAG = OPI_OpenAI.ПолучитьСтруктуруСообщения("user", ТекстRAG);
	Сообщения.Вставить(Сообщения.Количество() - 1, СообщениеRAG);

КонецПроцедуры

// ──────────────────────────────────────────────────────────────────────────────
// Основные методы отправки запросов
// ──────────────────────────────────────────────────────────────────────────────

// СпроситьChatCompletions
// Реализует запрос через /v1/chat/completions.
// Диалог ведётся путём передачи истории сообщений (из AI_Диалоги).
Процедура СпроситьChatCompletions()
	
	Сообщения = ИнициализироватьМассивСообщенийChatCompletions();
	
	ДополнительныеПараметры = ИнициализироватьДополнительныеПараметрыИНавыки();
	
	МассивФрагментовRAG = ОбработатьВекторныйЗапрос();
	ОбогатитьСообщенияRAG(Сообщения, МассивФрагментовRAG);
	
	Если _Провайдер = Справочники.AI_Провайдеры.LMStudio Тогда
		Ответ = AI_LMStudio.ПолучитьОтветВКонтексте(_БазовыйURL, _МодельСтрокой, Сообщения, ДополнительныеПараметры);
	Иначе
		Ответ = OPI_OpenAI.ПолучитьОтвет(_БазовыйURL, _APIКлюч, _МодельСтрокой, Сообщения, ДополнительныеПараметры);
	КонецЕсли;
	
	Если НЕ Ответ.Получить("error") = Неопределено Тогда
		ОшибкаОбработки = OPI_Инструменты.JSONСтрокой(Ответ);
		ПреобразоватьОтветВСтроку();
		Возврат;
	КонецЕсли;

	Попытка
		ВходящиеТокены = Ответ["usage"]["prompt_tokens"];
		ВыходящиеТокены = Ответ["usage"]["completion_tokens"];
	Исключение
	КонецПопытки;
	
	Попытка
		ИзвлечьОтвет();
		ЗаписатьСобытиеДиалога(Перечисления.AI_РольСообщения.user, _ТекстовыйЗапрос);
		ЗаписатьСобытиеДиалога(Перечисления.AI_РольСообщения.assistant, ИзвлеченныйОтвет);
		ЛогироватьЗапрос();
	Исключение
		ОшибкаОбработки = ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры

// СпроситьResponses
// Реализует запрос через /v1/responses.
// 
// ДИАЛОГ в Responses API:
//   Нативный механизм — передача previous_response_id. Сервер сам хранит контекст.
//   Это освобождает от необходимости передавать историю сообщениями.
//   При первом запросе в сессии _ПредыдущийIDОтвета пустой — передаём только входящее.
//   После каждого ответа сохраняем id ответа для следующего запроса.
//
// РАЗЛИЧИЯ Yandex vs OpenAI Responses:
//   - Yandex: инструмент веб-поиска: {"type":"web_search","search_context_size":"medium"}, tool_choice: "required"
//   - OpenAI: инструмент веб-поиска: {"type":"web_search_preview"}, tool_choice не требуется
//   - Yandex: структура ответа такая же как OpenAI Responses (output[].content[].text)
//   - Токены: Yandex возвращает usage.input_tokens / output_tokens,
//             OpenAI Responses возвращает usage.input_tokens / output_tokens
//
// RAG в Responses API:
//   RAG-контекст вставляется в системный промт (а не как отдельное сообщение),
//   поскольку в Responses API при наличии previous_response_id сообщения
//   пользователя — только новый ввод, без истории.
Процедура СпроситьResponses()
	
	ДополнительныеПараметры = ИнициализироватьДополнительныеПараметрыИНавыки();
	МассивФрагментовRAG = ОбработатьВекторныйЗапрос();
	
	// В Responses API RAG-контекст передаём через системный промт (instructions),
	// а не отдельным сообщением, т.к. при previous_response_id история не передаётся
	СистемныйПромтСRAG = СобратьСистемныйПромтСRAG(МассивФрагментовRAG);
	
	Сообщения = ИнициализироватьМассивСообщенийResponses(СистемныйПромтСRAG);
	
	// При диалоге передаём previous_response_id вместо истории сообщений
	Если _РежимДиалога И ЗначениеЗаполнено(_ПредыдущийIDОтвета) Тогда
		ДополнительныеПараметры.Вставить("previous_response_id", _ПредыдущийIDОтвета);
	КонецЕсли;
	
	ДопЗаголовки = Новый Соответствие;
	
	Если _Провайдер = Справочники.AI_Провайдеры.Yandex Тогда
		ДопЗаголовки.Вставить("x-project", _FolderID);
	КонецЕсли;
	
	Ответ = OPI_OpenAI.ПолучитьОтветResponses(_БазовыйURL, _APIКлюч, _МодельСтрокой, Сообщения, ДополнительныеПараметры, ДопЗаголовки);
	
	Если НЕ Ответ.Получить("error") = Неопределено Тогда
		ОшибкаОбработки = OPI_Инструменты.JSONСтрокой(Ответ);
		ПреобразоватьОтветВСтроку();
		Возврат;
	КонецЕсли;

	Попытка
		// Responses API: usage.input_tokens / output_tokens
		ВходящиеТокены = Ответ["usage"]["input_tokens"];
		ВыходящиеТокены = Ответ["usage"]["output_tokens"];
		ТулТокены = Ответ["usage"]["input_tokens_details"]["tool_tokens"]
	Исключение
	КонецПопытки;
	
	Попытка
		ИзвлечьОтветResponses();
		
		// Сохраняем ID ответа для следующего шага диалога
		IDОтвета = Ответ["id"];
		Если ЗначениеЗаполнено(IDОтвета) Тогда
			_ПредыдущийIDОтвета = IDОтвета;
		КонецЕсли;
		
		// Для совместимости с UI песочницы сохраняем и в ИдентификаторДиалога
		Если _РежимДиалога И Не ЗначениеЗаполнено(ИдентификаторДиалога) Тогда
			ИдентификаторДиалога = _ПредыдущийIDОтвета;
		КонецЕсли;
		
		ЛогироватьЗапрос();
	Исключение
		ОшибкаОбработки = ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры

// ИнициализироватьМассивСообщенийChatCompletions
// Строит массив сообщений для /v1/chat/completions.
// При режиме диалога обогащает историей из AI_Диалоги.
Функция ИнициализироватьМассивСообщенийChatCompletions()
	
	СообщениеСистемы = OPI_OpenAI.ПолучитьСообщениеСистемы(_СистемныйПромт);
	СообщениеПользователя = OPI_OpenAI.ПолучитьСообщениеПользователя(_ТекстовыйЗапрос);
	
	ПерваяИтерация = Ложь;
	Если _РежимДиалога И Не ЗначениеЗаполнено(ИдентификаторДиалога) Тогда
		ПолучитьИдентификаторДиалогаChatCompletions();
		ЗаписатьСобытиеДиалога(Перечисления.AI_РольСообщения.system, СообщениеСистемы["content"]);
		ПерваяИтерация = Истина;
	КонецЕсли;
	
	Сообщения = Новый Массив;
	Сообщения.Добавить(СообщениеСистемы);
	ОбогатитьСообщенияИсторией(ПерваяИтерация, Сообщения);
	ОбогатитьСообщенияДополнительнымКонтекстом(Сообщения);
	
	Сообщения.Добавить(СообщениеПользователя);
	
	Возврат Сообщения;
	
КонецФункции

// ИнициализироватьМассивСообщенийResponses
// В Responses API при первом запросе — передаём системный промт + сообщение пользователя.
// При последующих запросах диалога (previous_response_id заполнен) — только новое сообщение.
// Дополнительный контекст вставляется как отдельные сообщения пользователя.
//Функция ИнициализироватьМассивСообщенийResponses(Знач СистемныйПромт)
//	
//	Сообщения = Новый Массив;
//	
//	// Системный промт ("instructions") — только при первом сообщении диалога
//	// При наличии previous_response_id сервер уже знает инструкции
//	Если Не ЗначениеЗаполнено(_ПредыдущийIDОтвета) Тогда
//		Если ЗначениеЗаполнено(СистемныйПромт) Тогда
//			// В Responses API системный промт — это поле "instructions" в теле запроса,
//			// но его можно также передать как сообщение с ролью "system"
//			Сообщения.Добавить(OPI_OpenAI.ПолучитьСообщениеСистемы(СистемныйПромт));
//		КонецЕсли;
//		
//		// Дополнительный контекст — только при первом запросе
//		ОбогатитьСообщенияДополнительнымКонтекстом(Сообщения);
//	КонецЕсли;
//	
//	// Сообщение пользователя — всегда
//	Сообщения.Добавить(OPI_OpenAI.ПолучитьСообщениеПользователя(_ТекстовыйЗапрос));
//	
//	Возврат Сообщения;
//	
//КонецФункции 

Функция ИнициализироватьМассивСообщенийResponses(Знач СистемныйПромт)
    
    Сообщения = Новый Массив;
    
    Если Не ЗначениеЗаполнено(_ПредыдущийIDОтвета) Тогда
        
        Если ЗначениеЗаполнено(СистемныйПромт) Тогда
            Сообщения.Добавить(OPI_OpenAI.ПолучитьСообщениеСистемы(СистемныйПромт));
        КонецЕсли;
        
        ОбогатитьСообщенияДополнительнымКонтекстом(Сообщения);
        
    Иначе
        
        // При previous_response_id базовая история уже на стороне Responses API,
        // но свежий RAG текущего вопроса нужно передать явно.
        Если ЗначениеЗаполнено(СистемныйПромт) Тогда
            Сообщения.Добавить(OPI_OpenAI.ПолучитьСтруктуруСообщения("user", СистемныйПромт));
        КонецЕсли;
        
    КонецЕсли;
    
    Сообщения.Добавить(OPI_OpenAI.ПолучитьСообщениеПользователя(_ТекстовыйЗапрос));
    
    Возврат Сообщения;
    
КонецФункции

// ИзвлечьОтветResponses
// Responses API возвращает ответ в output[], а не в choices[].
// Структура: output[i].type == "message" => output[i].content[j].type == "output_text" => .text
// При наличии веб-поиска в output[] могут быть элементы с type="web_search_call" — их пропускаем.
Процедура ИзвлечьОтветResponses(ВСтруктуру = Ложь)
	
	ПреобразоватьОтветВСоответствие();
	
	МассивOutput = Ответ["output"];
	
	Если МассивOutput = Неопределено Или МассивOutput.Количество() = 0 Тогда
		ВызватьИсключение "Responses API: массив output пустой или отсутствует.";
	КонецЕсли;
	
	ТекстОтвета = "";
	
	Для Каждого ЭлементOutput Из МассивOutput Цикл
		
		ТипЭлемента = ЭлементOutput["type"];
		
		Если ТипЭлемента = "message" Тогда
			
			МассивContent = ЭлементOutput["content"];
			Если МассивContent = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого ЭлементContent Из МассивContent Цикл
				ТипContent = ЭлементContent["type"];
				Если ТипContent = "output_text" Или ТипContent = "text" Тогда
					ТекстОтвета = ТекстОтвета + ЭлементContent["text"];
				КонецЕсли;
			КонецЦикла;
			
		// web_search_call и другие служебные типы — пропускаем
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ТекстОтвета) Тогда
		ВызватьИсключение "Responses API: не удалось извлечь текст из output.";
	КонецЕсли;
	
	Если Лев(ТекстОтвета, 3) = "```" Тогда
		ТекстОтвета = Сред(ТекстОтвета, 4, СтрДлина(ТекстОтвета) - 4 - 3);
	КонецЕсли;
	
	ИзвлеченныйОтвет = ТекстОтвета;
	
	Если ВСтруктуру Тогда
		ИзвлеченныйОтвет = OPI_Инструменты.JsonВСтруктуру(ИзвлеченныйОтвет, Ложь);
	КонецЕсли;
	
КонецПроцедуры

// СобратьСистемныйПромтСRAG
// Для Responses API RAG-контекст встраивается в системный промт,
// т.к. при наличии previous_response_id дополнительные сообщения не передаются.
Функция СобратьСистемныйПромтСRAG(МассивФрагментов)
	
	СистемнаяИнструкция = _СистемныйПромт;
	
	Если ЗначениеЗаполнено(СистемнаяИнструкция) И ЗначениеЗаполнено(_ПредыдущийIDОтвета) И ЗначениеЗаполнено(МассивФрагментов) Тогда
		СистемнаяИнструкция = "";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МассивФрагментов) Тогда
		Возврат СистемнаяИнструкция;
	КонецЕсли;
	
	ЧастиТекста = Новый Массив;
	ЧастиТекста.Добавить(СистемнаяИнструкция);
	ЧастиТекста.Добавить("");
	ЧастиТекста.Добавить("--RAG_CONTEXT--");
	
	Для Каждого Фрагмент Из МассивФрагментов Цикл
		Заголовок = Фрагмент["header"];
		Если ЗначениеЗаполнено(Фрагмент["subheader"]) Тогда
			Заголовок = Заголовок + " / " + Фрагмент["subheader"];
		КонецЕсли;
		ВсегоЧанков = Фрагмент["chunks_total"];
		Если ВсегоЧанков > 1 Тогда
			Заголовок = СтрШаблон("%1 (чанк %2/%3)", Заголовок, Фрагмент["chunk_num"], ВсегоЧанков);
		КонецЕсли;
		ЧастиТекста.Добавить("### " + Заголовок);
		ЧастиТекста.Добавить(Фрагмент["text"]);
		Если ЗначениеЗаполнено(Фрагмент["nav_ref"]) Тогда
			ЧастиТекста.Добавить("[источник: " + Фрагмент["nav_ref"] + "]");
		КонецЕсли;
		ЧастиТекста.Добавить("");
	КонецЦикла;
	
	ЧастиТекста.Добавить("--END_RAG_CONTEXT--");
	
	Возврат СтрСоединить(ЧастиТекста, Символы.ПС);
	
КонецФункции

// СортироватьФрагментыПоScore
// Сортировка массива фрагментов по полю score по убыванию.
// Используется вместо несуществующего AI_ВекторныйПоиск.СортироватьФрагментыПоРелевантности.
Функция СортироватьФрагментыПоScore(МассивФрагментов)
	
	Н = МассивФрагментов.Количество();
	Для Индекс = 0 По Н - 2 Цикл
		Для Й = 0 По Н - Индекс - 2 Цикл
			Если МассивФрагментов[Й]["score"] < МассивФрагментов[Й + 1]["score"] Тогда
				Врем = МассивФрагментов[Й];
				МассивФрагментов[Й] = МассивФрагментов[Й + 1];
				МассивФрагментов[Й + 1] = Врем;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат МассивФрагментов;
	
КонецФункции

Процедура ПолучитьИдентификаторДиалогаChatCompletions()
	Если Не _РежимДиалога Тогда
		Возврат;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	ИдентификаторДиалога = РегистрыСведений.AI_Диалоги.НачатьДиалог();
КонецПроцедуры

#КонецОбласти
